[
  {
    "title": "Car Park fence replacement",
    "date": "2026-02-25",
    "type": "wrappedTextLeft",
    "image": "https://siteimages.gmfc.uk/news/newfence.jpg",
    "items": [
      {
        "itemtype": "text",
        "text": [
          "As the eagle-eyed will have noticed the fence in the car park required some work.",
          "The fence was replaced today with a new shiny one.",
          "Many thanks to those involved."
        ]
      }
    ],
    "hash": "21a7b2902c80fa46eda5dc48160d95b9"
  },
  {
    "title": "February maintenance help needed",
    "date": "2026-02-21",
    "type": "wrappedTextLeft",
    "imagesticker": "cancelled",
    "showhide": true,
    "image": "https://siteimages.gmfc.uk/news/helpneededtea.png",
    "items": [
      {
        "itemtype": "text",
        "text": [
          "We really could use your help 9-12!",
          "Come along and lend a hand! Coffee/tea, biscuits and dougnuts too. And good company!",
          "Fly or drive afterwards and enjoy our facilities."
        ]
      },
      {
        "itemtype": "list",
        "listitems": [
          "Clubhouse - needs a sweep. And sofa needs a good polish with leather restorers. I cleaned it last week as minor mould spots appeared. But needs protecting.<br><i>2 helpers? With the necessary polish items. We have broom.</i>",
          "Club Room needs sweeping and table polished and tidy up.<br><i>2 helpers? With the necessary polish items. We have broom.</i>",
          "Site tidy up - numerous bottles, cans and misc items need collecting and taking to tip<br><i>2-4 helpers with gloves , we have black bags.</i>",
          "Memorial ‘garden’ needs weeding and tidy u<br><i>2 helpers with weeding stuff and ‘green’ fingers. I’ve cut off most of offending branches and bramble. Quick task.",
          "Also we need to re-stack and tidy up outside rear of clubhouse<br><i>2-4 helpers with gloves</i>.",
          "The remains of the fallen tree is ‘parked’ in parking area . Chainsaw enthusiasts welcome to help themselves to firewood. BUT at own risk! Not a club task!",
          "Hopefully we will  also arrange a quick mow of strip."
        ]
      }
    ],
    "hash": "7a28c2147afccda8f993496a102f2938"
  },
  {
    "title": "Track only members (non Flying)",
    "date": "2026-01-05",
    "type": "wrappedTextLeft",
    "image": "https://siteimages.gmfc.uk/news/stand.jpg",
    "items": [
      {
        "itemtype": "text",
        "text": [
          "The Club have received a number of enquiries about joining Gordano Model Flying Club to use the RC track facilities. Details for ‘track only members (non Flying)’ are currently being finalised by the committee. We plan to admit new members in the Spring after the Club April AGM. Any new applications will be added to a waiting list until then.",
          "Visitors wishing to visit and view track facilities are welcome, but must contact the club in advance to arrange a suitable date. A committee member will act as host for their visit.",
          "Junior members (under 18) will aways require their parent/guardian to accompany them."
        ]
      }
    ],
    "hash": "9fab97d80a55dc310eaaf30a218bc8f6"
  },
  {
    "title": "Track only members (non Flying)",
    "date": "2026-01-05",
    "type": "wrappedTextLeft",
    "image": "https://siteimages.gmfc.uk/news/stand.jpg",
    "items": [
      {
        "itemtype": "text",
        "text": [
          "The Club have received a number of enquiries about joining Gordano Model Flying Club to use the RC track facilities. Details for ‘track only members (non Flying)’ are currently being finalised by the committee. We plan to admit new members in the Spring after the Club April AGM. Any new applications will be added to a waiting list until then.",
          "Visitors wishing to visit and view track facilities are welcome, but must contact the club in advance to arrange a suitable date. A committee member will act as host for their visit.",
          "Junior members (under 18) will aways require their parent/guardian to accompany them."
        ]
      }
    ],
    "hash": "9fab97d80a55dc310eaaf30a218bc8f6"
  },
  {
    "title": "GMFC and the CAA – Awareness for members",
    "date": "2025-01-01",
    "type": "wrappedTextLeft",
    "image": "https://siteimages.gmfc.uk/news/caa.jpg",
    "items": [
      {
        "itemtype": "text",
        "text": [
          "One area I perceive we will need to encourage more this year is CAA regulations.",
          "The Air Navigation Order obligations on anyone flying anything over 250g (or less if with a camera) are law. Your BMFA membership assumes compliance. So please, if you haven’t already read the latest position with respect to Flier ID (summarised in the January  BMFA newsletter – paper or online) get your Operator ID on to every model, and ensure you have gained a flier ID by undertaking the RCC test via the BMFA site.",
          "You might be wondering why I make this request now.  Well, first – its BMFA policy and the law. However also in November 2024 the club was contacted as an “interested party” in a CAA / National Police Air Service consultation. They propose to trial large (200kg+)  unmanned helicopters as a means of replacing police helicopters for surveillance/ search activity . Airspace over the Gordano valley will be included in that trail, and if implemented as proposed it would cause a total ban on weekday model flying for a period in late summer 2025. We have responded with a suggestion of how a minor change in the defined  boundary of the test zone could eliminate any chance of collisions, and that this is the sensible way to eliminate any theoretical risk.  But, bottom line, if a CAA Official visits the club to understand how reasonable our suggestion of airspace use is, it would be better if they observed we followed the regulations. Although its never been policy up to now to check, any of us could be asked to demonstrate that model identification at any point.",
          "We’ll obviously keep members aware of any updates to this consultation – I’m hopeful pragmatism of our suggestions will be successful.We’ll obviously keep members aware of any updates to this consultation – I’m hopeful pragmatism of our suggestions will be successful.",
          "Thank you",
          "<strong>Doug Dinnett – Chairman</strong>"
        ]
      }
    ],
    "hash": "b4991984287c893bff44ccef93b81ce2"
  },
  {
    "title": "Monthly Club Days",
    "date": "2025-01-01",
    "type": "wrappedTextLeft",
    "image": "https://siteimages.gmfc.uk/news/clubnews.jpg",
    "items": [
      {
        "itemtype": "text",
        "text": [
          "We aim to run monthly club days on the third weekend of the month throughout the year, weather depending.",
          "Saturday is general member flying. Sunday we hold a maintenance session in the morning, from 9am until 12pm (we expect all members to help out when they can, many hands make light work), this is followed by an afternoon of flying and some fun competitions. We will aim for something different each month. Please keep an eye on the flyers for each club day.",
          "Tea, coffee, squash and cakes are generally available with a donations box. In the summer we sometimes have a BBQ as well.",
          "On both days at least one member of the committee will be on site, so newcomers and interested parties are very welcome to visit on these days to introduce themselves and find out some more information about the club."
        ]
      }
    ],
    "hash": "fd338a7fdd97a4e62082031c341d7138"
  }
]